{
    "data": [
        {
            "id": 8478657,
            "by": "PhoenixWright",
            "text": "Really cool. Great layout and interesting articles. I&#x27;d post this on r&#x2F;gaming and see if it gets some traction.",
            "type": "comment",
            "parent": 8476970,
            "purpose": "subscription",
            "sent": true,
            "url": "http://boilingsteam.com/.",
            "title": "Show HN: BoilingSteam, My New Website Dedicated to Linux Gaming"
        },
        {
            "id": 8476970,
            "by": "ekianjo",
            "title": "Show HN: BoilingSteam, My New Website Dedicated to Linux Gaming",
            "url": "http://boilingsteam.com/.",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478658,
            "by": "astazangasta",
            "text": "Hey, just read bytecode, then. As small and fast as you can get.",
            "type": "comment",
            "parent": 8476311,
            "purpose": "subscription",
            "sent": true,
            "url": "http://archive.vector.org.uk/art10501320",
            "title": "Impending kOS"
        },
        {
            "id": 8476311,
            "by": "geocar",
            "text": "If someone produces smaller and faster code than me, then I should want to learn from it. I wonder why other people have the exact opposite reaction.<p>Why do you think that is?",
            "type": "comment",
            "parent": 8476269,
            "purpose": "additional-info"
        },
        {
            "id": 8476269,
            "by": "dang",
            "text": "Yes, the research literature on software development has consistently found that code size is the best measurement of complexity and predictor of error rates. (Sorry I don&#x27;t have citations handy but we&#x27;ve discussed this many times on HN, and there&#x27;s a recent study in the book &quot;Making Software&quot; that adds to it.) What&#x27;s interesting is how strongly this goes against what most people think they know about good programming and clear code.",
            "type": "comment",
            "parent": 8476189,
            "purpose": "additional-info"
        },
        {
            "id": 8476189,
            "by": "geocar",
            "text": "I disagree fundamentally.<p>I have noticed every page I scroll causes a comprehensive loss of around 90%, so in reading something that is 10 pagefuls long, I might only be able to produce a tiny part of the program.<p>Your milage may vary.<p>I find <i>not</i> scrolling, and just moving my eyes, I <i>rapidly</i> absorb the program, and I find most bugs <i>just by reading the code</i>. This practice is absolutely impossible for me if I have to scroll very far and made difficult by scrolling at all.<p>It is for this reason that I find simply counting the actual words to be an <i>excellent</i> estimate of complexity.<p>By the way: There are <i>several</i> temporary variables in that code; c:: creates a view called &quot;c&quot; which automatically updates whenever the dependent variables on the right side change.",
            "type": "comment",
            "parent": 8476113,
            "purpose": "additional-info"
        },
        {
            "id": 8476113,
            "by": "uberalex",
            "text": "I think that the issue is that just measuring simplicity in terms of number of lines is a bad metric. You can have extremely complex expressions in a single statement that are at least as hard to read and debug as an equivalent, much longer piece of code that employs temporary variables and single-purpose statements.",
            "type": "comment",
            "parent": 8476069,
            "purpose": "additional-info"
        },
        {
            "id": 8476069,
            "by": "wyc",
            "text": "If I posted four lines of Chinese or Sanskrit, it&#x27;s likely that native English speakers would disagree that they had much meaning either. However, this doesn&#x27;t mean that those lines are inherently devoid of meaning or difficult to parse.",
            "type": "comment",
            "parent": 8476056,
            "purpose": "additional-info"
        },
        {
            "id": 8476056,
            "by": "TheOsiris",
            "text": "&gt; “It is a lot easier to find your errors in four lines of code than in four hundred.”<p>Looking at his code on <a href=\"http://www.kparc.com/edit.k\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kparc.com&#x2F;edit.k</a> I&#x27;d like to disagree with that statement",
            "type": "comment",
            "parent": 8475809,
            "purpose": "additional-info"
        },
        {
            "id": 8475809,
            "by": "nightTrevors",
            "title": "Impending kOS",
            "url": "http://archive.vector.org.uk/art10501320",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478659,
            "by": "justinsb",
            "text": "First of all, 3 million rows a month is not that much from a database point of view - if evenly distributed, it would be about 1 per second.  (It is impressive to me from a business point of view though).  You don&#x27;t need Redis&#x27;s throughput, and you are hitting Redis&#x27;s limits with respect to memory.<p>1) This is _exactly_ the use case which relational databases were built and optimized for (fixed schema, OLTP, presumably some analytic queries).  You might want to normalize the data a little (e.g. the menu_items, employee_name, pos_type &amp; pos_version), but you don&#x27;t have to - this would just enable faster &amp; richer querying.<p>On your schema changes: I bet you&#x27;ll be much happier using a relational database which takes care of this stuff for you, then you will be implementing it yourself in Redis.  You probably won&#x27;t need partitioning either.  If you do end up needing partitioning, I would guess your DB is &quot;trivial&quot; to partition by customer.<p>I suspect you&#x27;ll also find that a relational database stores the data more efficiently, particularly if you normalize a few things.  Your data will probably fit into RAM again, but you&#x27;ll be able to cope even when it doesn&#x27;t.<p>2) Any relational database would be a great match for this, and would allow rich querying (e.g. by employee, by date, by restaurant).  My personal bias is to prefer Postgres.<p>3) I don&#x27;t see that Redis is getting you anything here.  It doesn&#x27;t support rich querying, is memory bound, and you don&#x27;t need the throughput it promises",
            "type": "comment",
            "parent": 8478537,
            "purpose": "subscription",
            "sent": true,
            "url": "",
            "title": "Ask HN: Going from redis to Mysql. Good idea?"
        },
        {
            "id": 8478537,
            "by": "gary4gar",
            "title": "Ask HN: Going from redis to Mysql. Good idea?",
            "url": "",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478660,
            "by": "jyxent",
            "text": "As pointed out in the reddit thread, this may be more a measure of the llvm backend used by rust to the gcc backend.  A more accurate comparison would be to clang.",
            "type": "comment",
            "parent": 8478486,
            "purpose": "subscription",
            "sent": true,
            "url": "http://benchmarksgame.alioth.debian.org/u64q/benchmark.php?test=all&lang=rust&lang2=gpp&data=u64q",
            "title": "Rust 0.12.0 vs. C++ [Computer Language Benchmarks Game]"
        },
        {
            "id": 8478486,
            "by": "tete",
            "title": "Rust 0.12.0 vs. C++ [Computer Language Benchmarks Game]",
            "url": "http://benchmarksgame.alioth.debian.org/u64q/benchmark.php?test=all&lang=rust&lang2=gpp&data=u64q",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478661,
            "by": "selmnoo",
            "text": "You haven&#x27;t really refuted any part of GP poster&#x27;s points. There&#x27;s no technical info on the site, there&#x27;s no telling what kind of user data they may be taking and doing who-knows-what with it. This is solid grounds to stay away from the product.",
            "type": "comment",
            "parent": 8478463,
            "purpose": "subscription",
            "sent": true,
            "url": "http://www.admuncher.com/free",
            "title": "After 15 years as shareware, Ad Muncher is now completely free"
        },
        {
            "id": 8478463,
            "by": "rational-future",
            "text": "Haha, quite self-sentric, aren&#x27;t we.<p>I&#x27;ve been reading sci fi books since the 1980s. I guess, by your logic, any title I haven&#x27;t heard about is just bad ...<p>I&#x27;ve been using AdMuncher since 2002 or so and IMHO it&#x27;s absolutely great. It&#x27;s the number 1 reason I didn&#x27;t switch my desktop to Linux. It&#x27;s also the reason I&#x27;m using a Windows tablet (Dell Venue 11 Pro).<p>This is the statistics, since last I installed Windows:<p>Statistics for Ad Muncher v4.93.33707&#x2F;5539\nAdverts removed: 181,604\nBandwidth saved: 5,346 MB \nCounter started: June 7, 2014<p>I&#x27;ve tried AdBlockPlus and uBlock many times, but they leave way more ads than AdMuncher. One of the reasons may be that they are more popular, so advertisers put more effort in defeating them.",
            "type": "comment",
            "parent": 8477921,
            "purpose": "additional-info"
        },
        {
            "id": 8477921,
            "by": "abcd_f",
            "text": "Zero technical info on the site, weird. But since it also filters out ads in non-browser apps, it should be some sort of proxy. Then how does it handle https&#x27;d ads? Self-signed certs and all? Perhaps dwindling supply of http resources and increasing privacy concerns are the reasons why it&#x27;s &quot;now completely free&quot; :-&#x2F;<p>PS. I&#x27;ve been Windows user since 3.11, I am very pro-privacy and I&#x27;ve never even heard of Ad Muncher. Make you what you want from it.",
            "type": "comment",
            "parent": 8477429,
            "purpose": "additional-info"
        },
        {
            "id": 8477429,
            "by": "MurrayHurps",
            "title": "After 15 years as shareware, Ad Muncher is now completely free",
            "url": "http://www.admuncher.com/free",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478662,
            "by": "pea",
            "text": "I&#x27;ve put them on Kivo, which might be easier to view and so people can annotate them.<p><a href=\"https://kivo.com/p/h985rFcI\" rel=\"nofollow\">https:&#x2F;&#x2F;kivo.com&#x2F;p&#x2F;h985rFcI</a>",
            "type": "comment",
            "parent": 8478604,
            "purpose": "subscription",
            "sent": true,
            "url": "http://cr.yp.to/talks/2014.10.18/slides-djb-20141018-a4.pdf",
            "title": "Making sure crypto remains insecure [pdf]"
        },
        {
            "id": 8478604,
            "by": "higherpurpose",
            "text": "Dan, your sliders are hard to read online, because you make us read the same slide four times, just for an extra sentence on each. It&#x27;s distracting. So please just put together the &quot;full&quot; slides when you put them online.",
            "type": "comment",
            "parent": 8478427,
            "purpose": "additional-info"
        },
        {
            "id": 8478427,
            "by": "zorked",
            "title": "Making sure crypto remains insecure [pdf]",
            "url": "http://cr.yp.to/talks/2014.10.18/slides-djb-20141018-a4.pdf",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478663,
            "by": "bsaul",
            "text": "I&#x27;ve only started to investigate rust for server side programming ( websocket in particular) but saw many discussions about the limitations rust has regarding parallel programming. \nYet, iirc servo did parallel rendering of html page, so that seems a contradiction. Anyone here knows about that ?<p>Specifically, i&#x27;m currently hesitating between golang and rust for coding a small Websocket chat server. I&#x27;m ready to use beta code because rust seems more promising to me in the long term than golang, but not if the language itself has severe fundamental limitations on server side programming.",
            "type": "comment",
            "parent": 8478486,
            "purpose": "subscription",
            "sent": true,
            "url": "http://benchmarksgame.alioth.debian.org/u64q/benchmark.php?test=all&lang=rust&lang2=gpp&data=u64q",
            "title": "Rust 0.12.0 vs. C++ [Computer Language Benchmarks Game]"
        },
        {
            "id": 8478486,
            "by": "tete",
            "title": "Rust 0.12.0 vs. C++ [Computer Language Benchmarks Game]",
            "url": "http://benchmarksgame.alioth.debian.org/u64q/benchmark.php?test=all&lang=rust&lang2=gpp&data=u64q",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478664,
            "by": "Istof",
            "title": "There's a small USB stick with Intel's Bay Trail CPU that can run Windows 8.1",
            "url": "http://www.wpcentral.com/theres-small-usb-stick-intels-bay-trail-cpu-can-run-windows-81",
            "type": "story",
            "purpose": "subscription",
            "sent": true
        },
        {
            "id": 8478665,
            "by": "sudokent",
            "text": "They are not, anything classified as &quot;High Risk&quot; cannot be serviced by Stripe, Balanced, Braintree, etc.<p>Again, from my research, it is because the partner banks will not allow them to.",
            "type": "comment",
            "parent": 8478625,
            "purpose": "subscription",
            "sent": true,
            "url": "",
            "title": "Ask HN: Are there any innovative startups in the porn/adult industry?"
        },
        {
            "id": 8478625,
            "by": "selmnoo",
            "text": "In the end Stripe could not work with her or other startups that feature &quot;a naked person&quot; on the product they&#x27;re selling (the article seems to claim), is that correct? I&#x27;m assuming then pay-for-porn sties are not permitted business wtih Stripe either?",
            "type": "comment",
            "parent": 8478525,
            "purpose": "additional-info"
        },
        {
            "id": 8478525,
            "by": "pc",
            "text": "I work at Stripe. Some details in the article aren&#x27;t very accurate.<p>But, more broadly, we actually work hard to push against the rules in many cases. (Cindy Gallop, mentioned earlier in the thread, can attest to this -- we spent ages trying to figure out a way to accept payments for her startup.)",
            "type": "comment",
            "parent": 8478299,
            "purpose": "additional-info"
        },
        {
            "id": 8478299,
            "by": "couchand",
            "text": "<i>Rybchin said she suspects it has something to do with tech being dominated by men, who might be nervous about working with a sex-toy startup: “All these companies are run by men, and they don’t appreciate a woman’s pleasure.”</i><p>I don&#x27;t know whether this really is the underlying issue, but damn, it&#x27;s unfortunate how plausible it is.  And the reaction from Stripe to the reporter&#x27;s request for comment all but confirms.",
            "type": "comment",
            "parent": 8478271,
            "purpose": "additional-info"
        },
        {
            "id": 8478271,
            "by": "chris_overseas",
            "text": "Here&#x27;s another data point confirming the &quot;regular world&quot; issues you mention: <a href=\"http://recode.net/2014/10/17/its-hard-out-there-for-a-sex-toy-entrepreneur/\" rel=\"nofollow\">http:&#x2F;&#x2F;recode.net&#x2F;2014&#x2F;10&#x2F;17&#x2F;its-hard-out-there-for-a-sex-to...</a>",
            "type": "comment",
            "parent": 8478189,
            "purpose": "additional-info"
        },
        {
            "id": 8478189,
            "by": "garethsprice",
            "text": "Cindy Gallop&#x27;s &quot;Make Love Not Porn&quot; (<a href=\"http://www.makelovenotporn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.makelovenotporn.com</a>) is trying to solve some of the issues around the rise of Internet pornography (addiction, detachment from intimacy, unrealistic&#x2F;degrading portrayal of women, etc).<p>She&#x27;s approaching it from a great, sex-positive way but is having issues whenever the company touches the &quot;regular world&quot; - hard to get funding, taken seriously by non-adult industry people, payment processing, etc.<p>The &quot;problems&quot; in Internet porn do not appear related to reducing barriers to access or better tech, but in solving issues with how people cope with sudden, instant access to a historically unprecedented amount of material.<p>Yet again, porn is trending ahead of regular tech use, which is also starting to deal with the same issues of addiction, information overload, how to monetize premium content in the face of a vast universe of free, tech saturation causing detachment and loss of intimacy (and the controversy over whether it does any of these in the first place).",
            "type": "comment",
            "parent": 8478079,
            "purpose": "additional-info"
        },
        {
            "id": 8478079,
            "by": "rblion",
            "title": "Ask HN: Are there any innovative startups in the porn/adult industry?",
            "url": "",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478666,
            "by": "TeMPOraL",
            "text": "I agree. One can accept this fact without ignoring that the aggregate differences between groups exist and are sometimes relevant. Otherwise we wouldn&#x27;t cluster people into those groups.",
            "type": "comment",
            "parent": 8478645,
            "purpose": "subscription",
            "sent": true,
            "url": "http://www.nytimes.com/2014/10/19/business/when-those-who-know-wont-share.html?ref=science",
            "title": "When Those Who Know Won’t Share"
        },
        {
            "id": 8478645,
            "by": "jwmerrill",
            "text": "I&#x27;d put it like this: variation among members of the same sex, race, country, age, etc. are very often larger and more important than aggregate differences between these groups. Ignoring this fact isn&#x27;t just bad politics, it&#x27;s sloppy thinking.",
            "type": "comment",
            "parent": 8478462,
            "purpose": "additional-info"
        },
        {
            "id": 8478462,
            "by": "TeMPOraL",
            "text": "This is not even a racial difference, it&#x27;s a cultural one.<p>But yes, it seems that people want the reality to conforms to political correctness by pretending that biological and cultural differences between sexes, races, countries, age, etc. don&#x27;t exist and shunning everyone who doesn&#x27;t agree.",
            "type": "comment",
            "parent": 8478413,
            "purpose": "additional-info"
        },
        {
            "id": 8478413,
            "by": "rational-future",
            "text": "Seriously what? Is it politically incorrect to mention racial differences at all now?",
            "type": "comment",
            "parent": 8478357,
            "purpose": "additional-info"
        },
        {
            "id": 8478357,
            "by": "idlewords",
            "text": "&quot;People like Japanese or Chinese&quot;? Seriously?",
            "type": "comment",
            "parent": 8478043,
            "purpose": "additional-info"
        },
        {
            "id": 8478043,
            "by": "Htsthbjig",
            "text": "Went I went to the US(Boston, from Europe) I was surprised by the behavior in University given by the intense private competition.<p>It is not the difficulty itself, as it is probably harder to study engineering in Europe or Asia, but the competitive mindset, &quot;every man for himself&quot;.<p>This has advantages, like taking plagiarism very seriously, but also terrible disadvantages, like not working well in groups.<p>People like Japanese or Chinese are trained in working in groups with disrespect for the individual. The American culture is the polar opposite, they worship individuals disrespecting the team, e.g you wont ever hear them talking about Edison&#x27;s team(of which Tesla was one of its members), or Steve Jobs&#x27;.<p>Americans love to believe that there is a person that does everything.<p>Having said that, in some companies they don&#x27;t share because of fear.<p>If you create a community like Microsoft&#x27;s four years ago in which for every team, the &quot;least qualified&quot;(even if all of them are great) is fired, you create a culture of threat and terror, and people are going to protect their selves.<p>You have also to take care, not putting too many leechers in the same place as the seeders, or the seeders won&#x27;t be able to solve problems(that they love to solve) because they are babysitters of the leechers full time(something they hate to do).<p>Some companies do not understand the last point, then they comply about people not sharing.<p>If you put together a team that admire each other, they share naturally.",
            "type": "comment",
            "parent": 8477882,
            "purpose": "additional-info"
        },
        {
            "id": 8477882,
            "by": "dnetesn",
            "title": "When Those Who Know Won’t Share",
            "url": "http://www.nytimes.com/2014/10/19/business/when-those-who-know-wont-share.html?ref=science",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478667,
            "by": "ishener",
            "text": "In my site (<a href=\"http://alephz.com\" rel=\"nofollow\">http:&#x2F;&#x2F;alephz.com</a>) I separate subscribers and just people with an email for password reset and important notices.<p>I am totally honest with user that subscribe and let them know that they will receive a daily update on new content in the site. It works pretty well, actually. A Relatively good amount of users sign up, and I get almost no unsubscribers.",
            "type": "comment",
            "parent": 8478444,
            "purpose": "subscription",
            "sent": true,
            "url": "",
            "title": "Ask HN: How do you gather email list signups in your web apps?"
        },
        {
            "id": 8478444,
            "by": "dwolfson20",
            "title": "Ask HN: How do you gather email list signups in your web apps?",
            "url": "",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478668,
            "by": "ekianjo",
            "text": "Thanks for the support and the nice comments, appreciate it :)",
            "type": "comment",
            "parent": 8478657,
            "purpose": "subscription",
            "sent": true,
            "url": "http://boilingsteam.com/.",
            "title": "Show HN: BoilingSteam, My New Website Dedicated to Linux Gaming"
        },
        {
            "id": 8478657,
            "by": "PhoenixWright",
            "text": "Really cool. Great layout and interesting articles. I&#x27;d post this on r&#x2F;gaming and see if it gets some traction.",
            "type": "comment",
            "parent": 8476970,
            "purpose": "additional-info"
        },
        {
            "id": 8476970,
            "by": "ekianjo",
            "title": "Show HN: BoilingSteam, My New Website Dedicated to Linux Gaming",
            "url": "http://boilingsteam.com/.",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478669,
            "by": "sarciszewski",
            "text": "I agree. Through PECL, PHP is soon going to have curve25519 support <a href=\"http://pecl.php.net/package/libsodium\" rel=\"nofollow\">http:&#x2F;&#x2F;pecl.php.net&#x2F;package&#x2F;libsodium</a><p>There&#x27;s already a Node-Sodium package... <a href=\"https://github.com/paixaop/node-sodium\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;paixaop&#x2F;node-sodium</a><p>Why can&#x27;t browsers support it natively? (e.g. through NSS)",
            "type": "comment",
            "parent": 8478613,
            "purpose": "subscription",
            "sent": true,
            "url": "http://cr.yp.to/talks/2014.10.18/slides-djb-20141018-a4.pdf",
            "title": "Making sure crypto remains insecure [pdf]"
        },
        {
            "id": 8478613,
            "by": "higherpurpose",
            "text": "I would also like to see Curve25519 (as well as others) supported in <i>all</i> browsers. It really bothers me that while at least websites are making an effort to default to ECDHE encryption with PFS, they have to resort to using the low-performance, insecure and probably NSA-backdoored P-256 curve, because most browsers aren&#x27;t supporting anything else right now.",
            "type": "comment",
            "parent": 8478598,
            "purpose": "additional-info"
        },
        {
            "id": 8478598,
            "by": "jvehent",
            "text": "Bernstein on a &quot;thought experiment&quot;, analyzing how government could have deliberately weakened cryptographic standards through various means.\nIt&#x27;s actually quite compelling, given that we know DES key size was weakened by the NSA back in the 70s, against IBM&#x27;s will, and that we know Dual_EC_DRBG was backdoored also by the NSA a few years ago.<p>Bernstein&#x27;s main point is that we need independent, peer-reviewed, cryptography that doesn&#x27;t depend on government standardization. This talk is mostly a justification for his own work on ChaCha20&#x2F;Poly1305 and DNSCurve, that were designed to be fast, constant-time and padding resistant. But the talk doesn&#x27;t make mention of alternatives, except for Serpent that should have been a better cipher than Rijndael in the AES competition.<p>A good read. I would love to see broader adoption of ChaCha20 in OpenSSL and its standardization in TLS1.3. Google already supports it and it needs more attention from cryptographic before we start using it everywhere. It also seems that SHA-3 has failed to convince, and everyone is standardizing on SHA-2 instead, despite the computational cost. Maybe here too we need an alternative...",
            "type": "comment",
            "parent": 8478427,
            "purpose": "additional-info"
        },
        {
            "id": 8478427,
            "by": "zorked",
            "title": "Making sure crypto remains insecure [pdf]",
            "url": "http://cr.yp.to/talks/2014.10.18/slides-djb-20141018-a4.pdf",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478670,
            "by": "tetraodonpuffer",
            "text": "why aren&#x27;t &#x27;know networks&#x27; gps-geofenced on smartphones? You have GPS, if your previous &#x27;known network&#x27; (say, home) was in location X, it should not automatically connect (or even <i>try</i> to connect) to it at X + 20 miles.<p>This way you should be able to keep your phone from connecting automatically to (or even looking for) a network that shouldn&#x27;t be there in that location in first place, and if you always tether to it it would work for your laptop too...",
            "type": "comment",
            "parent": 8475983,
            "purpose": "subscription",
            "sent": true,
            "url": "https://decorrespondent.nl/1101/What-we-give-away-when-we-log-on-to-a-public-Wi-Fi-network/31040493-53737dba",
            "title": "What we give away when we log on to a public Wi-Fi network"
        },
        {
            "id": 8475983,
            "by": "ricksta",
            "title": "What we give away when we log on to a public Wi-Fi network",
            "url": "https://decorrespondent.nl/1101/What-we-give-away-when-we-log-on-to-a-public-Wi-Fi-network/31040493-53737dba",
            "type": "story",
            "purpose": "additional-info"
        },
        {
            "id": 8478671,
            "by": "VexXtreme",
            "text": "I see a lot of comments here presenting HSTS as some kind of silver bullet for preventing MITM attacks. While it does help, it&#x27;s not impenetrable. If a website hasn&#x27;t been preloaded into the STS preloaded list, then the HSTS header can be stripped on the first visit and the client will never upgrade to SSL.<p>The only foolproof way to make sure you&#x27;re not being MITMd is to visually verify that the domain checks out and that you are indeed connected using SSL.",
            "type": "comment",
            "parent": 8475983,
            "purpose": "subscription",
            "sent": true,
            "url": "https://decorrespondent.nl/1101/What-we-give-away-when-we-log-on-to-a-public-Wi-Fi-network/31040493-53737dba",
            "title": "What we give away when we log on to a public Wi-Fi network"
        },
        {
            "id": 8475983,
            "by": "ricksta",
            "title": "What we give away when we log on to a public Wi-Fi network",
            "url": "https://decorrespondent.nl/1101/What-we-give-away-when-we-log-on-to-a-public-Wi-Fi-network/31040493-53737dba",
            "type": "story",
            "purpose": "additional-info"
        }
    ],
    "maxItem": 8478672
}